Revit 2027 API
GenericZone.GeometricDefinition Property
 The geometric definition for this generic zone.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ZoneGeometricDefinition GeometricDefinition { get; }
Public ReadOnly Property GeometricDefinition As ZoneGeometricDefinition
	Get
public:
property ZoneGeometricDefinition GeometricDefinition {
	ZoneGeometricDefinition get ();
}
member GeometricDefinition : ZoneGeometricDefinition with get
Property Value
ZoneGeometricDefinition
See Also
Reference
GenericZone Class
Autodesk.Revit.DB.Analysis Namespace